<a href="https://colab.research.google.com/github/leoberDr/taller3_PLE/blob/main/tablas_2_R.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
conos <- data.frame(
  Sabor = c("mora", "vainilla", "chocolate", "mora", "chocolate"),
  precio = c(3500, 4700, 6500, 5200, 5700)
)

print(conos)

      Sabor precio
1      mora   3500
2  vainilla   4700
3 chocolate   6500
4      mora   5200
5 chocolate   5700

In [ ]:
conos$Sabor

[1] "mora"      "vainilla"  "chocolate" "mora"      "chocolate"

In [ ]:
conos$precio

[1] 3500 4700 6500 5200 5700

In [ ]:
conos [ c("Sabor", "precio")]

  Sabor     precio
1 mora      3500
2 vainilla  4700
3 chocolate 6500
4 mora      5200
5 chocolate 5700

In [ ]:
conos[order(conos$Sabor, decreasing = TRUE), ]

  Sabor     precio
2 vainilla  4700
1 mora      3500
4 mora      5200
3 chocolate 6500
5 chocolate 5700

In [ ]:
head(conos, 2)

  Sabor    precio
1 mora     3500
2 vainilla 4700

In [ ]:
tail(conos, 1)

  Sabor     precio
5 chocolate 5700

In [ ]:
sample(conos)

  Sabor     precio
1 mora      3500
2 vainilla  4700
3 chocolate 6500
4 mora      5200
5 chocolate 5700

In [ ]:
conos[sample(nrow(conos), 1), ]

  Sabor     precio
3 chocolate 6500

In [ ]:
summary(conos)

    Sabor               precio
 Length:5           Min.   :3500
 Class :character   1st Qu.:4700
 Mode  :character   Median :5200
                    Mean   :5120
                    3rd Qu.:5700
                    Max.   :6500

In [ ]:
str(conos)

'data.frame':	5 obs. of  2 variables:
 $ Sabor : chr  "mora" "vainilla" "chocolate" "mora" ...
 $ precio: num  3500 4700 6500 5200 5700

In [ ]:
row.names(conos)

[1] "1" "2" "3" "4" "5"

In [ ]:
conos[4,]

  Sabor precio
4 mora  5200

In [ ]:
conos$precio[3]

[1] 6500

In [2]:
rownames(conos) <- make.unique(as.character(conos$Sabor))
conos

            Sabor     precio
mora        mora      3500
vainilla    vainilla  4700
chocolate   chocolate 6500
mora.1      mora      5200
chocolate.1 chocolate 5700

In [ ]:
resultado <- conos[conos$precio > 5000, ]


resultado

  Sabor     precio
3 chocolate 6500
4 mora      5200
5 chocolate 5700

In [ ]:
resultado2 <- conos[conos$precio > 3000 & conos$precio < 5000, ]
resultado2

  Sabor    precio
1 mora     3500
2 vainilla 4700

In [3]:
resultado_chocolate <- conos[conos$Sabor == "chocolate" & conos$precio < 6000, ]
resultado_chocolate

            Sabor     precio
chocolate.1 chocolate 5700